/**
 * @file cityConfig.h
 * @author Haode Du
 * @brief configurations for city data
 * @version 1.0
 * @date 2023-04-25
 * 
 */
#include <string>

const int CITY_NODE_NUM = 199;
const char* CITY_DATA = "data/city_datas_o.txt";
const int CITY_CDIMS = 40;
const int CITY_RDIMS = 39;
const std::string CITY_NODE_NAMES[] = {"安次区","安国市","安平县","安新县","霸州市","柏乡县","宝坻区","北辰区","北戴河区","滨海新区","博野县","沧县","曹妃甸区","昌黎县","昌平区","成安县","承德县","赤城县","崇礼区","磁县","丛台区","大厂回族自治县","大城县","大名县","大兴区","定兴县","定州市","东城区","东光县","东丽区","房山区","肥乡区","丰南区","丰宁满族自治县","丰润区","丰台区","峰峰矿区","抚宁区","阜城县","阜平县","复兴区","高碑店市","高阳县","高邑县","藁城区","沽源县","古冶区","固安县","故城县","馆陶县","广平县","广阳区","广宗县","海淀区","海港区","海兴县","邯山区","河北区","河间市","河西区","红桥区","怀安县","怀来县","怀柔区","黄骅市","鸡泽县","蓟州区","冀州区","津南区","晋州市","井陉矿区","井陉县","景县","竞秀区","静海区","巨鹿县","开平区","康保县","宽城满族自治县","涞水县","涞源县","乐亭县","蠡县","莲池区","临城县","临西县","临漳县","灵寿县","隆化县","隆尧县","卢龙县","鹿泉区","路北区","路南区","栾城区","滦南县","滦平县","滦州市","满城区","门头沟区","孟村回族自治县","密云区","南宫市","南和区","南开区","南皮县","内丘县","宁河区","宁晋县","平谷区","平泉市","平山县","平乡县","泊头市","迁安市","迁西县","青龙满族自治县","青县","清河县","清苑区","邱县","曲阳县","曲周县","饶阳县","任丘市","任泽区","容城县","三河市","沙河市","山海关区","尚义县","涉县","深泽县","深州市","石景山区","双滦区","双桥区","顺平县","顺义区","肃宁县","唐县","桃城区","万全区","望都县","威县","围场满族蒙古族自治县","蔚县","魏县","文安县","无极县","吴桥县","武安市","武强县","武清区","武邑县","西城区","西青区","下花园区","献县","香河县","辛集市","新河县","新乐市","行唐县","兴隆县","雄县","徐水区","宣化区","延庆区","盐山县","阳原县","易县","鹰手营子矿区","永年区","永清县","玉田县","裕华区","元氏县","运河区","赞皇县","枣强县","张北县","赵县","正定县","涿鹿县","涿州市","遵化市","河东区","和平区","信都区","桥西区(张家口市)","桥西区(石家庄市)","新华区(石家庄市)","新华区(沧州市)","长安区","朝阳区","通州区","襄都区","桥东区"};